README.org
#+AUTHOR:  Ista Zahn
#+TITLE: An emacs config for social scientists
#+STARTUP: showall
#+PROPERTY: header-args:emacs-lisp    :tangle init.el


* What is this?
:PROPERTIES:
:CUSTOM_ID: what-is-this
:END:
This is an [[https://www.gnu.org/software/emacs/][Emacs]] configuration. There are many like it, but this one is mine. If you like it, make it yours! It provides lots of functionality while keeping things light and fast.

The main goal of this project is to provide an Emacs configuration that works more or less they way you would expect an editor or IDE to work in the second decade of the twenty-first century, without losing the things that make Emacs special. This is challenging because basic Emacs commands often conflict with de facto standards. Each of these conflicts is a judgment call; hopefully a good balance has been reached. 

Note that this documentation mostly uses Emacs notation for keybindings, e.g., =C= means "the Ctrl key", =M= means "the Meta (aka Alt) key", and =S= means "the Shift key". Refer to https://www.emacswiki.org/emacs/EmacsKeyNotation if you are not familiar with this notation.

If you have never used Emacs before many things will work as you expect; a few will not, in which case you will need to search the web or read the Emacs documentation to learn the Emacs way. You can launch a built-in tutorial by pressing =C-h t= (that's "Control+h, then t"), or read the getting started documentation at https://www.gnu.org/software/emacs/tour/. A cheat-sheet / survival guide is available at https://www.gnu.org/software/emacs/refcards/pdf/survival.pdf. 

If you are an Emacs user, most things will mostly work as you expect, though you may wish to familiarize yourself with the alternative "de facto standard" bindings configured here.

Highlights include:
- More standard select/copy/paste keys and right-click behavior makes it more familiar to those new to Emacs.
- Consistent and familiar code completion using the =tab= key.
- Consistent and familiar code evaluation using =C-ret=.
- IDE-like configuration for R, Python, and LaTeX coding.
- Literate programming configuration for running R, python, or other programming languages inside markdown or org-mode files.
- Powerful and simple search-based tools for finding commands, files and buffers, inserting citations etc.
- Convenient window management, including navigation with =C-x O=, and undo/redo with =C-c left= and =C-c right=.

There are many more features, but these are the key ones. Details and the configuration itself are provided below.

* Quick start
:PROPERTIES:
:CUSTOM_ID: quick-start
:END:

** How to I install it?
:PROPERTIES:
:CUSTOM_ID: how-do-i-install-it
:END:
1) Make sure emacs >= version 24.5 is installed on your computer. See [[#suggested-external-programs][Suggested-external-programs]] for installation instructions.
2) Make sure you have [[http://git-scm.com/downloads][git]] installed on your computer. If you don't know what git is you might be interested in John McDonnell's [[http://nyuccl.org/pages/GitTutorial/][git tutorial]].
3) Determine your emacs configuration directory. Open emacs and type =C-x f ~/ RET=. This should open a directory listing buffer. Note the path at the top of this file. This is were your =s.d= should go.
4) Close Emacs.
5) Back up your existing =~/.emacs= file and =~/.emacs.d= directory (e.g., rename =.emacs= to =OLD.emacs= and rename =.emacs.d= to =OLD.emacs.d=).
6) Clone this repository into =~/.emacs.d= by opening a terminal and running =git clone http://github.com/izahn/dotemacs ~/.emacs.d=.

If you don't know how to use git, you can skip steps 2 and 6 and simply [[https://github.com/izahn/dotemacs/archive/master.zip][download the files as a zip archive]], extract them, and move them into your .emacs.d directory instead.

** First run
:PROPERTIES:
:CUSTOM_ID: first-run
:END:
Note that after installing this configuration emacs will be slow to start up the first time. This is due to package installation; just be patient and wait for it to finish--subsequent start-ups will be much faster.

** Important key bindings
:PROPERTIES:
:CUSTOM_ID: modified-key-bindings
:END:
This configuration loads a lot of useful emacs packages, many of which add key bindings. Documenting them all here would be too much (see the documentation for each package if you need the details), so this section describes only most important ones.

*** Standard keyboard shortcuts
- S-arrow :: Select a region, as in many other programs.
- C-c :: Copy selection, as in most other programs. 
- C-v :: Paste, as in most other programs. Select from the clipboard history with =S-C-v=.
- C-z :: Undo, as in most other programs.
- S-C-z :: Redo, as in most other programs. Use =C-x U=  or =M-z= to visualize your undo/redo history.
- C-o :: Open file, as in most other programs.

Note that some things still work "the Emacs way". Notably:
- C-a :: Goes to the beginning of the line. To select all use =C-x h=. 
- C-s :: Searches. To save, use =C-x s=. 
- C-f :: Moves forward one character. To search use =C-s=.

*** REPL interaction
This should be easy, and hopefully it is.

- C-RET :: Mapped to language specific line/selection/expression evaluation. Want to evaluate code from a script? =C-RET= should "just work".

*** Completion keys
:PROPERTIES:
:CUSTOM_ID: completion-keys
:END:
Many standard Emacs keybindings have been replaced with versions that provide completion suggestions. In-buffer completion can be triggered with the =tab= key.

- tab :: Mapped to =company-complete=, use for completion indentation and completion.
- M-y :: Remapped to =counsel-yank-pop= to browse the kill ring interactively. =S-C-v= also works for this.
- M-x :: Remapped to =counsel-M-x= to interactively search for interactive functions.
- C-c r :: Mapped to =ivy-bibtex= to search for a citation to insert. You must set =bibtex-completion-bibliography= to your BibTeX files for this to work.

*** Window management keys
Some convenient window management keys are provided, in addition to the standard Emacs =C-x o= binding to navigate to "other window".

- C-x O :: (Ctrl-x shift-o) mapped to =ace-window=, use to quickly navigate to a window by number.
- C-c left :: Mapped to =winner-undo=, use to undo a window change.
- C-c right :: Mapped to =winner-redo=, use to redo a window change.
- C-c C-l # :: Mapped to =eybrowse-switch-to-window-config=, use to save/restore window layouts.

*** Other key bindings
:PROPERTIES:
:CUSTOM_ID: other-key-bindings
:END:

- S-C-SPC :: Mapped to =cua-rectangle-mark-mode=, use to edit rectangular regions.
- C-up :: Mapped to =scroll-down-1=.
- C-down :: Mapped to =scroll-up-1=.
- M-Q :: Mapped to =unfill-paragraph=, use to remove line breaks from a paragraph.
- C-c C-o t :: Mapped to =outline-cycle=, use to hide/show when outline-minor-mode is active (outline-minor mode is enabled in programming modes and in LaTeX-mode).
- C-x cl :: Mapped to =global-command-log-mode=, use to echo keybindings for tutorials. 
- M-q :: Remapped to =bibtex-fill-entry= (bibtex mode only).
- E :: Open in external application (dired mode only)

Other key bindings can be discovered by =describe-bindings= (bound to =C-h b=) or =counsel-descbinds= (access with =M-x counsel-descbinds RET=), or via the menus.

* Interacting with external programs
Many of the Emacs features configured here are designed to make it easier to interact with external programs. For example, [[http://ess.r-project.org][ESS]] makes it easy to interact with [[http://r-project.org][R]], and [[https://www.gnu.org/software/auctex/][AUCTEX]] makes it easy to interact with [[http://tug.org/texlive/][LaTeX]]. If you need help installing these programs, [[file:UsefullPrograms.org][this short guide]] may help. 


* Implementation
  :PROPERTIES:
  :CUSTOM_ID: implementation
  :END:

I used to have a long description about all the packages this configuration sets up, but showing you the actual code is better. Each section starts with a description of what it does, followed by the code that implements it.

** Version check and preparation
   :PROPERTIES:
   :CUSTOM_ID: version-check
   :END:
It is difficult to support multiple versions of emacs, so we will pick an arbitrary cutoff and throw an error if the version of emacs is "too old".

#+BEGIN_SRC emacs-lisp
  (when (< (string-to-number 
             (concat 
              (number-to-string emacs-major-version) 
              "." 
              (number-to-string emacs-minor-version)))
            24.5)
    (error "Your version of emacs is very old and must be upgraded before you can use these packages!"))

  ;; set coding system so emacs doesn't choke on melpa file listings
  (set-language-environment 'utf-8)
  (setq locale-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (unless (eq system-type 'windows-nt)
    (set-selection-coding-system 'utf-8))
  (prefer-coding-system 'utf-8)
  (setq buffer-file-coding-system 'utf-8)
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

  (require 'cl)

  ;; set things that need to be set before packages load
  (setq outline-minor-mode-prefix "\C-c\C-o")
  (add-hook 'outline-minor-mode-hook
            (lambda () (local-set-key "\C-c\C-o"
                                      outline-mode-prefix-map)))
#+END_SRC

** Install useful packages
   :PROPERTIES:
   :CUSTOM_ID: install-useful-packages
   :END:
The main purpose of these emacs configuration files is to install and configure useful emacs packages. Here we carry out the installation.

#+BEGIN_SRC emacs-lisp
  ;; load site-start early so we can override it later
  (load "default" t t)
  ;; prevent site-start from running again later
  (setq inhibit-default-init t)

  ;; load the package manager
  (require 'package)

  ;; Add additional package sources
  (add-to-list 'package-archives 
               '("org" . "http://orgmode.org/elpa/") t)
  (add-to-list 'package-archives 
               '("melpa" . "http://melpa.milkbox.net/packages/") t)

  ;; Make a list of the packages you want
  (setq my-package-list '(;; gnu packages
                          auctex
                          windresize
                          diff-hl
                          adaptive-wrap
                          ;; melpa packages
                          command-log-mode
                          undo-tree
                          better-defaults
                          diminish
                          smart-mode-line
                          dired+
                          ace-window
                          howdoi
                          auctex-latexmk
                          multi-term
                          with-editor
                          eyebrowse
                          mouse3
                          swiper
                          counsel
                          flx-ido
                          smex
                          ivy-bibtex
                          which-key
                          outline-magic
                          smooth-scroll
                          unfill
                          company
                          ess
                          markdown-mode
                          polymode
                          eval-in-repl
                          haskell-mode
                          ghc
                          company-ghci
                          flycheck
                          scala-mode
                          ensime
                          sbt-mode
                          exec-path-from-shell
                          htmlize
                          ;; org-mode packages
                          org-plus-contrib))

  ;; Activate package autoloads
  (package-initialize)
  (setq package-initialize nil)

  ;; make sure stale packages don't get loaded
  (dolist (package my-package-list)
    (if (featurep package)
        (unload-feature package t)))
  ;; Install packages in package-list if they are not already installed
  (unless (every #'package-installed-p my-package-list)
    (package-refresh-contents)
    (dolist (package my-package-list)
      (when (not (package-installed-p package))
        (package-install package))))
#+END_SRC

