init.el
(when (< (string-to-number 
           (concat 
            (number-to-string emacs-major-version) 
            "." 
            (number-to-string emacs-minor-version)))
          24.5)
  (error "Your version of emacs is very old and must be upgraded before you can use these packages!"))

;; set coding system so emacs doesn't choke on melpa file listings
(set-language-environment 'utf-8)
(setq locale-coding-system 'utf-8)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(unless (eq system-type 'windows-nt)
  (set-selection-coding-system 'utf-8))
(prefer-coding-system 'utf-8)
(setq buffer-file-coding-system 'utf-8)
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

(require 'cl)

;; set things that need to be set before packages load
(setq outline-minor-mode-prefix "\C-c\C-o")
(add-hook 'outline-minor-mode-hook
          (lambda () (local-set-key "\C-c\C-o"
                                    outline-mode-prefix-map)))

;; load site-start early so we can override it later
(load "default" t t)
;; prevent site-start from running again later
(setq inhibit-default-init t)

;; load the package manager
(require 'package)

;; Add additional package sources
(add-to-list 'package-archives 
             '("org" . "http://orgmode.org/elpa/") t)
(add-to-list 'package-archives 
             '("melpa" . "http://melpa.milkbox.net/packages/") t)

;; Make a list of the packages you want
(setq my-package-list '(;; gnu packages
                        auctex
                        windresize
                        diff-hl
                        adaptive-wrap
                        ;; melpa packages
                        undo-tree
                        better-defaults
                        diminish
                        smart-mode-line
                        dired+
                        ace-window
                        howdoi
                        auctex-latexmk
                        multi-term
                        with-editor
                        eyebrowse
                        mouse3
                        swiper
                        counsel
                        flx-ido
                        smex
                        ivy-bibtex
                        which-key
                        outline-magic
                        smooth-scroll
                        unfill
                        company
                        ess
                        markdown-mode
                        polymode
                        eval-in-repl
                        haskell-mode
                        ghc
                        company-ghci
                        flycheck
                        scala-mode
                        ensime
                        sbt-mode
                        exec-path-from-shell
                        htmlize
                        ;; org-mode packages
                        org-plus-contrib))

;; Activate package autoloads
(package-initialize)
(setq package-initialize nil)

;; make sure stale packages don't get loaded
(dolist (package my-package-list)
  (if (featurep package)
      (unload-feature package t)))
;; Install packages in package-list if they are not already installed
(unless (every #'package-installed-p my-package-list)
  (package-refresh-contents)
  (dolist (package my-package-list)
    (when (not (package-installed-p package))
      (package-install package))))

;; mode line theme
