README.org
** Load theme
   :PROPERTIES:
   :CUSTOM_ID: load-theme
   :END:
Loading the theme should come as early as possible in the init sequence to avoid jarring visual changes during startup, but must come after loading packages because we use a custom theme that needs to be installed first.

#+BEGIN_SRC emacs-lisp
  ;; mode line theme
  (add-hook 'after-init-hook 'sml/setup)
  (setq sml/theme 'light)

#+END_SRC
** Add custom lisp directory to load path
   :PROPERTIES:
   :CUSTOM_ID: add-custom-lisp-directory-to-load-path
   :END:
We try to install most things using the package manager, but a few things need to be included in a custom lisp directory. Add it to the path so we can load from it easily.
#+BEGIN_SRC emacs-lisp
  ;; add custom lisp directory to path
  (let ((default-directory (concat user-emacs-directory "lisp/")))
    (setq load-path
          (append
           (let ((load-path (copy-sequence load-path))) ;; Shadow
             (append 
              (copy-sequence (normal-top-level-add-to-load-path '(".")))
              (normal-top-level-add-subdirs-to-load-path)))
           load-path)))

  ;; on OSX Emacs needs help setting up the system paths
  (when (memq window-system '(mac ns))
    (exec-path-from-shell-initialize))

#+END_SRC

#+RESULTS:

** Tweak default Emacs settings
   :PROPERTIES:
   :CUSTOM_ID: miscellaneous
   :END:

This section sets up various utilities and conveniences. Many of these are low priority, so we set them first in order to allow any conflicting settings to be overridden later.

#+BEGIN_SRC emacs-lisp
  ;; better defaults are well, better... but we don't always agree
  (menu-bar-mode 1)

  ;; Mouse scrolling behavior
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))) ;; one line at a time
  (setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse

  ;; Use y/n instead of yes/no
  (fset 'yes-or-no-p 'y-or-n-p)

  (transient-mark-mode 1) ; makes the region visible
  (line-number-mode 1)    ; makes the line number show up
  (column-number-mode 1)  ; makes the column number show up

  ;; ;; smooth scrolling with C-up/C-down
  (require 'smooth-scroll)
  (smooth-scroll-mode)
  (global-set-key [(control down)] 'scroll-up-1)
  (global-set-key [(control up)] 'scroll-down-1)
  (global-set-key [(control left)] 'scroll-right-1)
  (global-set-key [(control right)] 'scroll-left-1)

  ;; make home and end behave
  (global-set-key (kbd "<home>") 'move-beginning-of-line)
  (global-set-key (kbd "<end>") 'move-end-of-line)

  ;; enable toggling paragraph un-fill
  (define-key global-map "\M-Q" 'unfill-paragraph)

  ;; line wrapping
  (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
  (setq visual-line-fringe-indicators '(left-curly-arrow right-curly-arrow))
  (remove-hook 'text-mode-hook 'turn-on-auto-fill)
  (add-hook 'visual-line-mode-hook 'adaptive-wrap-prefix-mode)
  (add-hook 'text-mode-hook 'visual-line-mode 1)
  (add-hook 'prog-mode-hook
            (lambda()
              (toggle-truncate-lines t)
                (outline-minor-mode t)))

  ;; don't require two spaces for sentence end.
  (setq sentence-end-double-space nil)

  ;; The beeping can be annoying--turn it off
  (set-variable 'visible-bell t)
#+END_SRC

** Make Emacs friendlier to newcomers
Emacs will never to as simple as Notepad, but perhaps it can be made more consistent with the way most other programs behave.

#+BEGIN_SRC emacs-lisp
  ;; Use CUA mode to make life easier. We _do_ use standard copy/paste etc. 
  (cua-mode t)

  ;; (cua-selection-mode t) ;; uncomment this to get cua goodness without copy/paste etc.

  ;; ;; Make control-z undo
  (global-undo-tree-mode t)
  (global-set-key (kbd "C-z") 'undo)
  (define-key undo-tree-map (kbd "C-S-z") 'undo-tree-redo)
  (define-key undo-tree-map (kbd "C-x u") 'undo)
  (define-key undo-tree-map (kbd "C-x U") 'undo-tree-visualize)
  (define-key undo-tree-map (kbd "M-z") 'undo-tree-visualize)
  ;; Make C-g quit undo tree
  (define-key undo-tree-visualizer-mode-map (kbd "C-g") 'undo-tree-visualizer-quit)
  (define-key undo-tree-visualizer-mode-map (kbd "<escape> <escape> <escape>") 'undo-tree-visualizer-quit)



  ;; ;; 
  ;; Make right-click do something close to what people expect
  (global-set-key (kbd "<mouse-3>") 'mouse3-popup-menu)
  ;; (global-set-key (kbd "C-f") 'isearch-forward)
  ;; (global-set-key (kbd "C-s") 'save-buffer)
  ;; (global-set-key (kbd "C-o") 'counsel-find-file)
  (define-key cua-global-keymap (kbd "<C-S-SPC>") nil)
  (define-key cua-global-keymap (kbd "<C-return>") nil)
  (setq cua-rectangle-mark-key (kbd "<C-S-SPC>"))
  (define-key cua-global-keymap (kbd "<C-S-SPC>") 'cua-rectangle-mark-mode)
#+END_SRC

** Window Management
   :PROPERTIES:
   :CUSTOM_ID: window-management
   :END:

Emacs has [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Configuration-Registers.html#Configuration-Registers][window layout management]], built-in but it's not convenient to use. [[https://github.com/wasamasa/eyebrowse][Eyebrowse]] makes it easier, so we use that. Create a new layout with =C-c C-l C-n=, switch with =C-c C-l #= . 

The basic window navigation with =C-c C-o= does not make it easy to navigate quickly to a specific window, so we use =ace-window= for that. Use =C-x O= to quickly navigate to a window.

=winner-mode= allows you to undo/redo window configuration changes. Use =C-c <left>= to undo adn =C-c <right>= to redo.

#+BEGIN_SRC emacs-lisp
  ;; Work spaces
  (setq eyebrowse-keymap-prefix (kbd "C-c C-l"))
  (eyebrowse-mode t)

  ;; Undo/redo window changes
  (winner-mode 1)

  ;; use ace-window for navigating windows
  (global-set-key (kbd "C-x O") 'ace-window)
  (with-eval-after-load "ace-window"
    (set-face-attribute 'aw-leading-char-face nil :height 2.5))
#+END_SRC

** Spell checking
   :PROPERTIES:
   :CUSTOM_ID: spell-checking
   :END:

Emacs comes with spell checking built-in, it just needs to be turned on. By default automatic spell checking is enabled in =text-mode= and =prog-mode= buffers.

You can also spell-check on demand with =ispell-word=, bound to =M-$=.

#+BEGIN_SRC emacs-lisp
  ;; enable on-the-fly spell checking
  (add-hook 'text-mode-hook
            (lambda ()
              (flyspell-mode 1)))
  ;; prevent flyspell from finding mistakes in the code
  (add-hook 'prog-mode-hook
            (lambda ()
              ;; `ispell-comments-and-strings'
              (flyspell-prog-mode)))

  ;; ispell should not check code blocks in org mode
  (add-to-list 'ispell-skip-region-alist '(":\\(PROPERTIES\\|LOGBOOK\\):" . ":END:"))
  (add-to-list 'ispell-skip-region-alist '("#\\+BEGIN_SRC" . "#\\+END_SRC"))
  (add-to-list 'ispell-skip-region-alist '("#\\+begin_src" . "#\\+end_src"))
  (add-to-list 'ispell-skip-region-alist '("^#\\+begin_example " . "#\\+end_example$"))
  (add-to-list 'ispell-skip-region-alist '("^#\\+BEGIN_EXAMPLE " . "#\\+END_EXAMPLE$"))
#+END_SRC

** Printing
   :PROPERTIES:
   :CUSTOM_ID: printing
   :END:
If you're using [[http://vgoulet.act.ulaval.ca/en/emacs/windows/][Vincent Goulet's emacs]] on Windows printing should work out of the box. If you're on Linux or Mac the experience of printing from emacs may leave something to be desired. Here we try to make it work a little better by making it easier to preview buffers in a web browser (you can print from there as usual) and by using [[http://sourceforge.net/projects/gtklp/][gtklp]] on Linux if it is available.

#+BEGIN_SRC emacs-lisp

  (when (eq system-type 'gnu/linux)
    (setq hfyview-quick-print-in-files-menu t)
    (require 'hfyview)
    (setq mygtklp (executable-find "gtklp"))
    (when mygtklp
      (setq lpr-command "gtklp")
      (setq ps-lpr-command "gtklp")))

  (when (eq system-type 'darwin)
    (setq hfyview-quick-print-in-files-menu t)
    (require 'hfyview))
#+END_SRC

