README.org
*** Minibuffer hints and completion
:PROPERTIES:
:CUSTOM_ID: minibuffer-hints-and-completion
:END:
There are several different systems for providing completion hints in emacs. The default pcomplete system shows completions on demand (usually bound to tab key) in an emacs buffer. Here we set up ivy, which instead shows these completions on-the-fly in the minibuffer. These completions are primarily used to show available files (e.g., with ~find-file~) and emacs functions (e.g., with ~execute-extended-command~). Completion for in-buffer text (e.g., methods in python-mode, or arguments in R-mode) are handled separately by [[#auto-complete-configuration][company-mode]].

#+BEGIN_SRC emacs-lisp
  (ivy-mode 1)

  (setq counsel-find-file-ignore-regexp "\\`\\.")
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-display-style nil)

  ;; Ivy-based interface to standard commands
  (global-set-key (kbd "C-s") 'swiper)
  (global-set-key (kbd "C-r") 'swiper)
  (global-set-key (kbd "M-x") 'counsel-M-x)
  (global-set-key (kbd "M-y") 'counsel-yank-pop)
  (global-set-key (kbd "C-S-v") 'counsel-yank-pop)
  (global-set-key (kbd "C-x C-f") 'counsel-find-file)
  (global-set-key (kbd "C-o") 'counsel-find-file)
  (global-set-key (kbd "C-x C-r") 'counsel-recentf)
  (global-set-key (kbd "<C-tab>") 'counsel-company)
  (global-set-key (kbd "<f1> f") 'counsel-describe-function)
  (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
  (global-set-key (kbd "<f1> l") 'counsel-load-library)
  (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
  (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
  ;; Ivy-based interface to shell and system tools
  (global-set-key (kbd "C-c g") 'counsel-git)
  (global-set-key (kbd "C-c j") 'counsel-git-grep)
  (global-set-key (kbd "C-c k") 'counsel-ag)
  (global-set-key (kbd "C-x l") 'counsel-locate)
  (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
  ;; Ivy-resume and other commands

  (global-set-key (kbd "C-c C-r") 'ivy-resume)

  ;; Make Ivy more like ido
  (define-key ivy-minibuffer-map (kbd "<return>") 'ivy-alt-done)
  (define-key ivy-minibuffer-map (kbd "C-d") 'ivy-done)
  (define-key ivy-minibuffer-map (kbd "C-b") 'ivy-immediate-done)
  (define-key ivy-minibuffer-map (kbd "C-f") 'ivy-immediate-done)

  ;; show recently opened files
  (setq recentf-max-menu-items 50)
  (recentf-mode 1)

#+END_SRC

*** Auto-complete configuration
:PROPERTIES:
:CUSTOM_ID: auto-complete-configuration
:END:
Here we configure in-buffer text completion using the company-mode package. These completions are available on-demand using =tab= for in-buffer popup or =C-tab= for search-able minibuffer list.

#+BEGIN_SRC emacs-lisp
  (require 'company)
  ;; cancel if input doesn't match, be patient, and don't complete automatically.
  (setq company-require-match nil
        company-async-timeout 6
        company-idle-delay nil)
  ;; complete using C-tab
  (global-set-key (kbd "<C-tab>") 'counsel-company)
  ;; use C-n and C-p to cycle through completions
  ;; (define-key company-mode-map (kbd "<tab>") 'company-complete)
  (define-key company-active-map (kbd "C-n") 'company-select-next)
  (define-key company-active-map (kbd "<tab>") 'company-complete-common)
  (define-key company-active-map (kbd "C-p") 'company-select-previous)
  (define-key company-active-map (kbd "<backtab>") 'company-select-previous)

  (require 'company-capf)
  ;; put company-capf and company-files at the beginning of the list
  (setq company-backends
        (delete-dups (cons 'company-files (cons 'company-capf company-backends))))
  (setq-default company-backends
                (delete-dups (cons 'company-files (cons 'company-capf company-backends))))

  ;;Use tab to complete.
  ;; From https://github.com/company-mode/company-mode/issues/94
  (define-key company-mode-map [remap indent-for-tab-command]
    'company-indent-for-tab-command)

  (setq tab-always-indent 'complete)

  (defvar completion-at-point-functions-saved nil)

  (defun company-indent-for-tab-command (&optional arg)
    (interactive "P")
    (let ((completion-at-point-functions-saved completion-at-point-functions)
          (completion-at-point-functions '(company-complete-wrapper)))
      (indent-for-tab-command arg)))

  (defun company-complete-wrapper ()
    (let ((completion-at-point-functions completion-at-point-functions-saved))
      (company-complete)))

  ;; not sure why this should be set in a hook, but that is how the manual says to do it.
  (add-hook 'after-init-hook 'global-company-mode)
#+END_SRC

** Which-key
   :PROPERTIES:
   :CUSTOM_ID: which-key
   :END:

This mode shows a keymap when an incomplete command is entered. It is especially useful for families of commands with a prefix, e.g., =C-c C-o= for =outline-mode= commands, or =C-c C-v= for =org-babel= commands. Just start typing your command and pause if you want a hint.

#+BEGIN_SRC emacs-lisp
;; (require 'which-key)
(which-key-mode)
#+END_SRC

** Flycheck
Provides on-the-fly syntax checking. Depends on external tools, e.g, [[https://cran.rstudio.com/web/packages/lintr/index.html][lintr]] for R code, [[https://flake8.readthedocs.io/en/latest/][flake8]] for python. See http://www.flycheck.org/en/latest/languages.html#flycheck-languages for supported languages and tools.

#+BEGIN_SRC emacs-lisp
;; (require 'flycheck)
(global-flycheck-mode)
#+END_SRC

** Outline-magic
   :PROPERTIES:
   :CUSTOM_ID: outline-magic
   :END:
I encourage you to use [[*Note taking and outlining (Org-mode)][org-mode]] for note taking and outlining, but it can be convenient to treat arbitrary buffers as outlines. The outline-magic mode can help with that.

#+BEGIN_SRC emacs-lisp
  ;;; Configure outline minor modes
  ;; Less crazy key bindings for outline-minor-mode
  (setq outline-minor-mode-prefix "\C-c\C-o")
  ;; load outline-magic along with outline-minor-mode
  (add-hook 'outline-minor-mode-hook 
            (lambda () 
              (require 'outline-magic)
              (define-key outline-minor-mode-map "\C-c\C-o\t" 'outline-cycle)))
#+END_SRC

** Major modes configuration
   :PROPERTIES:
   :CUSTOM_ID: major-modes-configuration
   :END:


*** General REPL (comint) config
    :PROPERTIES:
    :CUSTOM_ID: general-repl-config
    :END:

Many programs using REPLs are derived from =comint-mode=, so we can affect all of them by changing =comint-mode= settings. Here we disable line wrapping and ask programs to echo the input.

Load eval-in-repl for bash, elisp, and python interaction.
#+BEGIN_SRC emacs-lisp
  ;; require the main file containing common functions
  (require 'eval-in-repl)
  (setq comint-process-echoes t)

  ;; truncate lines in comint buffers
  (add-hook 'comint-mode-hook
            (lambda()
              (setq truncate-lines 1)))

  ;; Scroll down for input and output
  (setq comint-scroll-to-bottom-on-input t)
  (setq comint-scroll-to-bottom-on-output t)
  (setq comint-move-point-for-output t)
#+END_SRC

*** Run R in emacs (ESS)
    :PROPERTIES:
    :CUSTOM_ID: run-r-in-emacs
    :END:

Support for R in Emacs is good, thanks to http://ess.r-project.org/. As with other programming languages this configuration enables completion via the =tab= key and code evaluation with =C-ret=. Many more features are provided by ESS, refer to http://ess.r-project.org/ for details.

#+BEGIN_SRC emacs-lisp
    ;;;  ESS (Emacs Speaks Statistics)

  ;; Start R in the working directory by default
  (setq ess-ask-for-ess-directory nil)

  ;; Make sure ESS is loaded before we configure it
  (autoload 'julia "ess-julia" "Start a Julia REPL." t)
  (with-eval-after-load "ess-site"
    ;; disable ehoing input
    (setq ess-eval-visibly nil)
    ;; Start R in the working directory by default
    (setq ess-ask-for-ess-directory nil)
    ;; Use tab completion
    (setq ess-tab-complete-in-script t)
    ;; extra ESS stuff inspired by https://github.com/gaborcsardi/dot-emacs/blob/master/.emacs
    (ess-toggle-underscore nil)
    (defun my-ess-execute-screen-options (foo)
      "cycle through windows whose major mode is inferior-ess-mode and fix width"
      (interactive)
      (setq my-windows-list (window-list))
      (while my-windows-list
        (when (with-selected-window (car my-windows-list) (string= "inferior-ess-mode" major-mode))
          (with-selected-window (car my-windows-list) (ess-execute-screen-options t)))
        (setq my-windows-list (cdr my-windows-list))))
    (add-to-list 'window-size-change-functions 'my-ess-execute-screen-options)
    (define-key ess-mode-map (kbd "<C-return>") 'ess-eval-region-or-function-or-paragraph-and-step)
    ;; truncate long lines in R source files
    (add-hook 'ess-mode-hook
              (lambda()
                ;; don't wrap long lines
                (toggle-truncate-lines t)
                (outline-minor-mode t))))
#+END_SRC

*** Run python in emacs (python-mode)
    :PROPERTIES:
    :CUSTOM_ID: run-python-in-emacs
    :END:

Emacs has decent python support out of the box. As with other programming languages you can get completion suggestions with the =tab= key, and evaluate code with =C-ret=. Many more features are provided and are accessible via the menu.

#+BEGIN_SRC emacs-lisp
  (with-eval-after-load "python"
    ;; try to get indent/completion working nicely
    (setq python-indent-trigger-commands '(company-indent-for-tab-command indent-for-tab-command yas-expand yas/expand))
    ;; readline support is wonky at the moment
    (setq python-shell-completion-native-enable nil)
    ;; simple evaluation with C-ret
    (require 'eval-in-repl-python)
    (define-key python-mode-map "\C-c\C-c" 'eir-eval-in-python)
    (define-key python-mode-map (kbd "<C-return>") 'eir-eval-in-python))
#+END_SRC

