README.org
*** emacs lisp REPL (ielm)
    :PROPERTIES:
    :CUSTOM_ID: emacs-lisp-repl
    :END:

If you want to get the most out of Emacs, you'll eventually need to learn a little Emacs-lisp. This configuration helps by providing a standard =C-ret= evaluation key binding, and by providing completion with the =tab= key.

#+BEGIN_SRC emacs-lisp
  (with-eval-after-load "elisp-mode"
    (require 'company-elisp)
    ;; ielm
    (require 'eval-in-repl-ielm)
    ;; For .el files
    (define-key emacs-lisp-mode-map "\C-c\C-c" 'eir-eval-in-ielm)
    (define-key emacs-lisp-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
    ;; For *scratch*
    (define-key lisp-interaction-mode-map "\C-c\C-c" 'eir-eval-in-ielm)
    (define-key emacs-lisp-mode-map (kbd "<C-return>") 'eir-eval-in-ielm)
    ;; For M-x info
    (define-key Info-mode-map "\C-c\C-c" 'eir-eval-in-ielm)
    ;; Set up completions
    (add-hook 'emacs-lisp-mode-hook
              (lambda()
                ;; make sure completion calls company-elisp first
                (require 'company-elisp)
                (setq-local company-backends
                            (delete-dups (cons 'company-elisp (cons 'company-files company-backends)))))))
#+END_SRC

*** Haskell mode
    :PROPERTIES:
    :CUSTOM_ID: light-weight-markup-language
    :END:
I just recently started learning Haskell. There's not much to the configuration at this point, but you should get completion with =tab=.

#+BEGIN_SRC emacs-lisp
  (require 'company-ghci)
  (add-hook 'haskell-mode-hook (lambda ()
                                 (setq-local company-backends
                                             (delete-dups (cons 'company-ghci (cons 'company-files company-backends))))))
  (add-hook 'haskell-interactive-mode-hook 'company-mode)
#+END_SRC

*** Light-weight markup language (Markdown mode)
    :PROPERTIES:
    :CUSTOM_ID: light-weight-markup-language
    :END:

Markdown is a light-weight markup language that makes easy things easy and stays out of your way. You can export Markdown documents to a wide range of formats including .pdf (via latex), .html, .doc, and more using =pandoc=. For more information about authoring markdown in Emacs refer to http://jblevins.org/projects/markdown-mode/. For information about Markdown syntax or exporting to other formats refer to http://pandoc.org.

#+BEGIN_SRC emacs-lisp
  ;; Use markdown-mode for files with .markdown or .md extensions
  (add-to-list 'auto-mode-alist '("\\.markdown\\'" . markdown-mode))
  (add-to-list 'auto-mode-alist '("\\.md\\'" . markdown-mode))
#+END_SRC

*** Typesetting markup (AucTeX)
    :PROPERTIES:
    :CUSTOM_ID: typesetting-markup
    :END:
I don't write nearly as much in LaTeX as I used to, as Markdown and/or Org mode are simpler and good enough for my needs. But LaTeX is still the tool of choice for much academic writing, so we use AUCTEX and turn on lots of features. Completion of math and latex commands is available with =tab=, and auto-compile is available with =C-ret=.

  See https://www.gnu.org/software/auctex/ for more details about AUCTEX. 

#+BEGIN_SRC emacs-lisp
  ;; AucTeX config
  (with-eval-after-load "Latex"
    ;; Easy compile key
    (define-key LaTeX-mode-map (kbd "<C-return") 'TeX-command-run-all)
    ;; Allow paragraph filling in tables
    (setq LaTeX-indent-environment-list
          (delq (assoc "table" LaTeX-indent-environment-list)
                LaTeX-indent-environment-list))
    (setq LaTeX-indent-environment-list
          (delq (assoc "table*" LaTeX-indent-environment-list)
                LaTeX-indent-environment-list))
    ;; Misc. latex settings
    (setq TeX-parse-self t
          TeX-auto-save t)
    (setq-default TeX-master nil)
    ;; Add beamer frames to outline list
    (setq TeX-outline-extra
          '((".*\\\\begin{frame}\n\\|.*\\\\begin{frame}\\[.*\\]\\|.*\\\\begin{frame}.*{.*}\\|.*[       ]*\\\\frametitle\\b" 3)))
    ;; reftex settings
    (setq reftex-enable-partial-scans t)
    (setq reftex-save-parse-info t)
    (setq reftex-use-multiple-selection-buffers t)
    (setq reftex-plug-into-AUCTeX t)
    (add-hook 'LaTeX-mode-hook
              (lambda ()
                (turn-on-reftex)
                (TeX-PDF-mode t)
                (LaTeX-math-mode)
                (TeX-source-correlate-mode t)
                (imenu-add-to-menubar "Index")
                (outline-minor-mode)))
    (add-hook 'bibtex-mode-hook
              (lambda ()
                (define-key bibtex-mode-map "\M-q" 'bibtex-fill-entry))))
#+END_SRC


*** Citations (ivy-bibtex)
This allows you to search your BibTeX files for references to insert into the current document. For it to work you will need to set `bibtex-completion-bibliography` to the location of your BibTeX files.

Initiate a citation search with =ivy-bibtex=, bound to =C-c r=.

See https://github.com/tmalsburg/helm-bibtex for information about reading attached .pdf files, searching online bibliography sources and more.

#+BEGIN_SRC emacs-lisp
  (setq ivy-bibtex-default-action 'bibtex-completion-insert-citation)
  (global-set-key (kbd "C-c r") 'ivy-bibtex)
#+END_SRC
*** Note taking and outlining (Org-mode)
    :PROPERTIES:
    :CUSTOM_ID: note-taking-and-outlining
    :END:

Org mode is a powerful markup-language native to Emacs. It can be compared to markdown, but it has many more features. I use it for note taking a preparing lecture materials, but people use it for all kinds of things, from TODO lists to project planning to authoring academic papers. The settings below try to make Org mode play nicely with other packages, and enable many of the literate programming features. More information about Org mode can be found at [[http://orgmode.org]]. 

#+BEGIN_SRC emacs-lisp 
  (with-eval-after-load "org"
    (setq org-replace-disputed-keys t)
    (setq org-support-shift-select t)
    (setq org-export-babel-evaluate nil)
    ;; (setq org-startup-indented t)
    ;; increase imenu depth to include third level headings
    (setq org-imenu-depth 3)
    ;; Set sensible mode for editing dot files
    (add-to-list 'org-src-lang-modes '("dot" . graphviz-dot))
    ;; Update images from babel code blocks automatically
    (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
    ;; configure org-mode when opening first org-mode file
    ;; Load additional export formats
    (require 'ox-odt)
    (require 'ox-md)
    (require 'ox-freemind)
    (require 'ox-bibtex)
    ;; Enable common programming language support in org-mode
    (require 'ess-site)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((R . t)
       (python . t)
       (matlab . t)
       (emacs-lisp . t)
       (sh . t)
       (dot . t)
       (latex . t)
       (octave . t)
       (ditaa . t)
       (org . t)
       (perl . t)
       (julia . t)
       ))
    ;; Fontify code blocks in org-mode
    (setq org-src-fontify-natively t)
    (setq org-src-tab-acts-natively t)
    (setq org-confirm-babel-evaluate nil)
    (require 'org-capture)
    (require 'org-protocol)
    (require 'ob-stata))

#+END_SRC

*** Multiple modes in one "buffer" (polymode)
    :PROPERTIES:
    :CUSTOM_ID: multiple-modes-in-one-buffer
    :END:

Emacs uses different /modes/ for different kinds of files and buffers. This is what makes is possible to have one set of behaviors when editing LaTeX, and a different set of behaviors when writing R code. But what if we want to do both, in the same file? Then we need to have multiple modes, in the same buffer, and we can thanks to [[https://github.com/vspinu/polymode][polymode]]. 

#+BEGIN_SRC emacs-lisp
  ;;; polymode
  ;; polymode requires emacs >= 24.3, does not work on the RCE. 
  (when (>= (string-to-number 
             (concat 
              (number-to-string emacs-major-version) 
              "." 
              (number-to-string emacs-minor-version)))
            24.3)
    ;; Activate polymode for files with the .md extension
    (add-to-list 'auto-mode-alist '("\\.md" . poly-markdown-mode))
    ;; Activate polymode for R related modes
    (add-to-list 'auto-mode-alist '("\\.Snw" . poly-noweb+r-mode))
    (add-to-list 'auto-mode-alist '("\\.Rnw" . poly-noweb+r-mode))
    (add-to-list 'auto-mode-alist '("\\.Rmd" . poly-markdown+r-mode))
    (add-to-list 'auto-mode-alist '("\\.rapport" . poly-rapport-mode))
    (add-to-list 'auto-mode-alist '("\\.Rhtml" . poly-html+r-mode))
    (add-to-list 'auto-mode-alist '("\\.Rbrew" . poly-brew+r-mode))
    (add-to-list 'auto-mode-alist '("\\.Rcpp" . poly-r+c++-mode))
    (add-to-list 'auto-mode-alist '("\\.cppR" . poly-c++r-mode)))
#+END_SRC

