README.org
*** Email (mu4e)
Not everyone wants to read email in Emacs, but you can if you want. The settings below configure some basic things, but you will need additional configuration to set up your email accounts. See the [[http://www.djcbsoftware.nl/code/mu/mu4e/index.html#Top][mue4 manual]] and [[http://www.djcbsoftware.nl/code/mu/mu4e/Example-configurations.html#Example-configurations][example configurations]] for details.

#+BEGIN_SRC emacs-lisp
  (when (executable-find "mu")
    (autoload 'mu4e "mu4e" "Read your mail." t)
    (with-eval-after-load "mu4e"
      (setq mu4e-headers-include-related t
            mu4e-headers-skip-duplicates t
            mu4e-headers-fields '(
                                  (:human-date . 12)
                                  (:flags . 6)
                                  (:mailing-list . 10)
                                  (:from-or-to . 22)
                                  (:thread-subject)))
      ;; don't keep message buffers around
      (setq message-kill-buffer-on-exit t)
      ;; enable notifications
      (setq mu4e-enable-mode-line t)
      ;; use org for composing rich text emails
      (require 'org-mu4e)
      (setq org-mu4e-convert-to-html t)
      (define-key mu4e-headers-mode-map (kbd "C-c c") 'org-mu4e-store-and-capture)
      (define-key mu4e-view-mode-map    (kbd "C-c c") 'org-mu4e-store-and-capture)
      ;; render html
      (require 'mu4e-contrib)
      (setq mu4e-html2text-command 'mu4e-shr2text)))
  
#+END_SRC

*** File browsing (Dired+)
    :PROPERTIES:
    :CUSTOM_ID: file-browsing
    :END:
Emacs makes a decent file browser, we just need to tweak a few things to make it nicer. In particular you can open files in an external program using the =E= key.

#+BEGIN_SRC emacs-lisp
  ;;; Dired and Dired+ configuration
  (add-hook 'dired-mode-hook 
            (lambda()
              (diff-hl-dired-mode)
              (diff-hl-margin-mode)))

  ;; show details by default
  (setq diredp-hide-details-initially-flag nil)

  ;; set dired listing options
  (if (eq system-type 'gnu/linux)
      (setq dired-listing-switches "-alDhp"))

  ;; make sure dired buffers end in a slash so we can identify them easily
  (defun ensure-buffer-name-ends-in-slash ()
    "change buffer name to end with slash"
    (let ((name (buffer-name)))
      (if (not (string-match "/$" name))
          (rename-buffer (concat name "/") t))))
  (add-hook 'dired-mode-hook 'ensure-buffer-name-ends-in-slash)
  (add-hook 'dired-mode-hook
            (lambda()
               (setq truncate-lines 1)))

  ;; open files in external programs
  ;; (from http://ergoemacs.org/emacs/emacs_dired_open_file_in_ext_apps.html
  ;; consider replacing with https://github.com/thamer/runner
  (defun xah-open-in-external-app (&optional file)
    "Open the current file or dired marked files in external app.

  The app is chosen from your OS's preference."
    (interactive)
    (let (doIt
          (myFileList
           (cond
            ((string-equal major-mode "dired-mode")
             (dired-get-marked-files))
            ((not file) (list (buffer-file-name)))
            (file (list file)))))
      (setq doIt (if (<= (length myFileList) 5)
                     t
                   (y-or-n-p "Open more than 5 files? "))) 
      (when doIt
        (cond
         ((string-equal system-type "windows-nt")
          (mapc
           (lambda (fPath)
             (w32-shell-execute "open" (replace-regexp-in-string "/" "\\" fPath t t)))
           myFileList))
         ((string-equal system-type "darwin")
          (mapc
           (lambda (fPath)
             (shell-command (format "open \"%s\"" fPath)))
           myFileList))
         ((string-equal system-type "gnu/linux")
          (mapc
           (lambda (fPath)
             (let ((process-connection-type nil))
               (start-process "" nil "xdg-open" fPath))) myFileList))))))
  ;; use zip/unzip to compress/uncompress zip archives
  (with-eval-after-load "dired-aux"
    (add-to-list 'dired-compress-file-suffixes 
                 '("\\.zip\\'" "" "unzip"))
    ;; open files from dired with "E"
    (define-key dired-mode-map (kbd "E") 'xah-open-in-external-app))
#+END_SRC

*** Shell modes (term, shell and eshell)
    :PROPERTIES:
    :CUSTOM_ID: shell-modes
    :END:
There are several different shells available in Emacs by default. In addition =multi-term= is available to give you a nicer way of running your default shell in Emacs. Convenience functions are enabled to set your EDITOR variable so that Emacs will be used as your editor when running shell commands inside Emacs. 

#+BEGIN_SRC emacs-lisp
  ;; term
  (with-eval-after-load "term"
  (define-key term-mode-map (kbd "C-j") 'term-char-mode)
  (define-key term-raw-map (kbd "C-j") 'term-line-mode))

  (with-eval-after-load "multi-term"
  (define-key term-mode-map (kbd "C-j") 'term-char-mode)
  (define-key term-raw-map (kbd "C-j") 'term-line-mode))

  ;; shell
  (require 'essh) ; if not done elsewhere; essh is in the local lisp folder
  (require 'eval-in-repl-shell)
  (add-hook 'sh-mode-hook
            (lambda()
               (local-set-key "\C-c\C-c" 'eir-eval-in-shell)))


  ;; Automatically adjust output width in commint buffers
  ;; from http://stackoverflow.com/questions/7987494/emacs-shell-mode-display-is-too-wide-after-splitting-window
  (defun comint-fix-window-size ()
    "Change process window size."
    (when (derived-mode-p 'comint-mode)
      (let ((process (get-buffer-process (current-buffer))))
        (unless (eq nil process)
          (set-process-window-size process (window-height) (window-width))))))

  (defun my-shell-mode-hook ()
    ;; add this hook as buffer local, so it runs once per window.
    (add-hook 'window-configuration-change-hook 'comint-fix-window-size nil t))

  (add-hook 'shell-mode-hook
            (lambda()
               ;; add this hook as buffer local, so it runs once per window.
               (add-hook 'window-configuration-change-hook 'comint-fix-window-size nil t)))

  ;; extra completion for eshell
  (add-hook 'eshell-mode-hook
            (lambda()
               ;; programs that don't work well in eshell and should be run in visual mode
               (add-to-list 'eshell-visual-commands "ssh")
               (add-to-list 'eshell-visual-commands "tail")
               (add-to-list 'eshell-visual-commands "htop")
               (setq eshell-visual-subcommands '(("git" "log" "diff" "show")))))

  ;; Use emacs as editor when running external processes or using shells in emacs
  (require 'with-editor)
  (add-hook 'shell-mode-hook
            (lambda()
              (with-editor-export-editor)
              (with-editor-export-git-editor)))
  (add-hook 'term-exec-hook
            (lambda()
              (with-editor-export-editor)
              (with-editor-export-git-editor)))
  (add-hook 'eshell-mode-hook
            (lambda()
              (with-editor-export-editor)
              (with-editor-export-git-editor)))

  (shell-command-with-editor-mode t)
#+END_SRC

** Demonstration tools (command-log-mode)

=command-log-mode= is useful for giving emacs demonstrations/tutorials. It shows the keys you've pressed and the commands they called.

#+BEGIN_SRC emacs-lisp
  (setq command-log-mode-auto-show t)
  (global-set-key (kbd "C-x cl") 'global-command-log-mode)
#+END_SRC

** Always use fancy splash screen.
   :PROPERTIES:
   :CUSTOM_ID: visual-tweaks
   :END:

Add some information to the startup screen so people know where to go for help.
#+BEGIN_SRC emacs-lisp
    ;; always use fancy-startup, even on small screens
    ;; but only if running in windowed mode
    (defun always-use-fancy-splash-screens-p () 1)
    (defalias 'use-fancy-splash-screens-p 'always-use-fancy-splash-screens-p)
    (add-hook 'after-init-hook
              (lambda()
                (if inhibit-startup-screen
                    (add-hook 'emacs-startup-hook 
                              (lambda() (switch-to-buffer "*scratch*"))))))

  (add-to-list 'fancy-startup-text
               '(:face
                 (variable-pitch default)
                 "\nYou are running a customized Emacs configuration. See "  :link
                 ("here"
                  #[257 "\300\301!\207"
                        [browse-url-default-browser "http://github.com/izahn/dotemacs/"]
                        3 "\n\n(fn BUTTON)"]
                  "Open the README file")
                 "\nfor information about these customizations.\n"))
#+END_SRC

** Final touches

#+BEGIN_SRC emacs-lisp
  ;; save settings made using the customize interface to a sparate file
  (setq custom-file (concat user-emacs-directory "custom.el"))
  (unless (file-exists-p custom-file)
    (write-region ";; Put user configuration here" nil custom-file))
  (load custom-file 'noerror)

  ;; ;; clean up the mode line
  ; (require 'diminish)
  ;; (diminish 'company-mode)
  (diminish 'google-this-mode)
  (diminish 'outline-minor-mode)
  (diminish 'smooth-scroll-mode)
#+END_SRC

* Concluding remarks

That's all folks, report any bugs or feature requests at [[https://github.com/izahn/dotemacs]].
